###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/9365693d-7834-4e21-a60c-3980cd52036b/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecs_service.blue has changed
  ~ resource "aws_ecs_service" "blue" {
        id                                 = "arn:aws:ecs:us-east-1:457234550057:service/skills-dev-cluster/skills-dev-service-blue"
        name                               = "skills-dev-service-blue"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:457234550057:task-definition/skills-dev-task-blue:54" -> "arn:aws:ecs:us-east-1:457234550057:task-definition/skills-dev-task-blue:81"
        # (15 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "primary"
          + "Name"       = "primary"
        }
      + tags_all               = {
          + "Attributes" = "primary"
          + "Name"       = "primary"
        }
      + vpc_id                 = "vpc-011e18228237e2f80"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.sg.aws_security_group_rule.keyed["HTTP"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + description              = "Allow HTTP from inside the security group"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.sg.aws_security_group_rule.keyed["ssh"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH from anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.sg.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = jsonencode(
                {
                  + HTTP               = {
                      + cidr_blocks              = []
                      + description              = "Allow HTTP from inside the security group"
                      + from_port                = 80
                      + ipv6_cidr_blocks         = []
                      + key                      = "HTTP"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = true
                      + source_security_group_id = null
                      + to_port                  = 80
                      + type                     = "ingress"
                    }
                  + _allow_all_egress_ = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow all egress"
                      + from_port                = 0
                      + ipv6_cidr_blocks         = [
                          + "::/0",
                        ]
                      + key                      = "_allow_all_egress_"
                      + prefix_list_ids          = []
                      + protocol                 = "-1"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 0
                      + type                     = "egress"
                    }
                  + ssh                = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow SSH from anywhere"
                      + from_port                = 22
                      + ipv6_cidr_blocks         = []
                      + key                      = "ssh"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 22
                      + type                     = "ingress"
                    }
                }
            )
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_ecs_service.blue has changed%0A  ~ resource "aws_ecs_service" "blue" {%0A        id                                 = "arn:aws:ecs:us-east-1:457234550057:service/skills-dev-cluster/skills-dev-service-blue"%0A        name                               = "skills-dev-service-blue"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:us-east-1:457234550057:task-definition/skills-dev-task-blue:54" -> "arn:aws:ecs:us-east-1:457234550057:task-definition/skills-dev-task-blue:81"%0A        # (15 unchanged attributes hidden)%0A%0A%0A%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.sg.aws_security_group.cbd[0] will be created%0A  + resource "aws_security_group" "cbd" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Attributes" = "primary"%0A          + "Name"       = "primary"%0A        }%0A      + tags_all               = {%0A          + "Attributes" = "primary"%0A          + "Name"       = "primary"%0A        }%0A      + vpc_id                 = "vpc-011e18228237e2f80"%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.sg.aws_security_group_rule.keyed["HTTP"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + description              = "Allow HTTP from inside the security group"%0A      + from_port                = 80%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = true%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 80%0A      + type                     = "ingress"%0A    }%0A%0A  # module.sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all egress"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + ipv6_cidr_blocks         = [%0A          + "::/0",%0A        ]%0A      + prefix_list_ids          = []%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.sg.aws_security_group_rule.keyed["ssh"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow SSH from anywhere"%0A      + from_port                = 22%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 22%0A      + type                     = "ingress"%0A    }%0A%0A  # module.sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created%0A  + resource "null_resource" "sync_rules_and_sg_lifecycles" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "sg_ids" = (known after apply)%0A        }%0A    }%0A%0A  # module.sg.random_id.rule_change_forces_new_security_group[0] will be created%0A  + resource "random_id" "rule_change_forces_new_security_group" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 3%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A      + keepers     = {%0A          + "rules" = jsonencode(%0A                {%0A                  + HTTP               = {%0A                      + cidr_blocks              = []%0A                      + description              = "Allow HTTP from inside the security group"%0A                      + from_port                = 80%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "HTTP"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = true%0A                      + source_security_group_id = null%0A                      + to_port                  = 80%0A                      + type                     = "ingress"%0A                    }%0A                  + _allow_all_egress_ = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow all egress"%0A                      + from_port                = 0%0A                      + ipv6_cidr_blocks         = [%0A                          + "::/0",%0A                        ]%0A                      + key                      = "_allow_all_egress_"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "-1"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 0%0A                      + type                     = "egress"%0A                    }%0A                  + ssh                = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow SSH from anywhere"%0A                      + from_port                = 22%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "ssh"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 22%0A                      + type                     = "ingress"%0A                    }%0A                }%0A            )%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @nisalikularatne, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deployment - Dev`*